#+title: Debug
#+PROPERTY: header-args :results drawer


* Problem with container failing on second started

Debugging steps using =docker-compose up=

** Wait for debug by changing entrypoint

#+begin_src yaml
        entrypoint:
            - /bin/bash
            - -xc
            - |
              /opt/bitnami/scripts/drupal/entrypoint.sh /opt/bitnami/scripts/apache/run.sh
              sleep 9000
#+end_src


** Enter the container and install some packages

#+begin_src bash
apt update
apt install mc ncdu tree
#+end_src


** Main folder is =/opt/bitnami=


#+begin_src bash
docker exec -u root -ti drupalday2024-drupal-1 bash -c "ls -larth /opt/bitnami/"
#+end_src

#+RESULTS:
:results:
drwxr-xr-x  6 root root 4.0K Sep  3 14:40 common
drwxr-xr-x  4 root root 4.0K Oct  8 17:35 peclapcu
drwxr-xr-x 11 root root 4.0K Oct  9 12:27 drupal-plugin-ctools
drwxr-xr-x  2 root root 4.0K Oct  9 13:18 licenses
-rw-r--r--  1 root root  811 Oct  9 13:18 .bitnami_components.json
lrwxrwxrwx  1 root root    6 Oct  9 13:19 apache2 -> apache
drwxrwxr-x  1 root root 4.0K Oct  9 13:20 apache
drwxr-xr-x  1 root root 4.0K Oct  9 13:20 php
drwxr-xr-x  1 root root 4.0K Oct  9 13:20 ..
drwxr-xr-x  6 root root 4.0K Oct  9 13:20 mysql
drwxr-xr-x  1 root root 4.0K Oct  9 13:20 .
drwxr-xr-x  1 root root 4.0K Oct 14 11:54 scripts
drwxrwxr-x  1 root root 4.0K Oct 14 11:55 drupal
:end:

#+begin_src bash
docker exec -u root -ti drupalday2024-drupal-1 bash -c "ls -larth /opt/bitnami/drupal"
#+end_src

#+RESULTS:
:results:
-rw-rw-r--  1 root root 2.0K Oct  9 12:20 robots.txt
-rw-rw-r--  1 root root  549 Oct  9 12:20 index.php
-rw-rw-r--  1 root root 1.5K Oct  9 12:20 example.gitignore
-rw-rw-r--  1 root root 3.2K Oct  9 12:20 README.md
-rw-rw-r--  1 root root  18K Oct  9 12:20 LICENSE.txt
-rw-rw-r--  1 root root 4.2K Oct  9 12:20 .gitattributes
-rw-rw-r--  1 root root   41 Oct  9 12:20 .eslintrc.json
-rw-rw-r--  1 root root  151 Oct  9 12:20 .eslintignore
-rw-rw-r--  1 root root  357 Oct  9 12:20 .editorconfig
-rw-rw-r--  1 root root    0 Oct  9 12:20 .buildcomplete
-rw-rw-r--  1 root root  804 Oct  9 12:20 update.php
-rw-rw-r--  1 root root   87 Oct  9 12:20 INSTALL.txt
-rw-rw-r--  1 root root 2.5K Oct  9 12:20 .ht.router.php
-rw-rw-r--  1 root root 1.1K Oct  9 12:20 .csslintrc
-rw-rw-r--  1 root root 3.6K Oct  9 12:20 composer.json
-rw-rw-r--  1 root root 228K Oct  9 12:20 composer.lock
-rw-rw-r--  1 root root  265 Oct  9 12:20 autoload.php
-rw-rw-r--  1 root root 121K Oct  9 13:11 .spdx-drupal.spdx
drwxrwxr-x  2 root root 4.0K Oct  9 13:20 licenses
drwxrwxr-x 13 root root 4.0K Oct  9 13:20 core
drwxrwxr-x 30 root root 4.0K Oct  9 13:20 vendor
-rw-rw-r--  1 root root  154 Oct  9 13:20 .htaccess
drwxr-xr-x  1 root root 4.0K Oct  9 13:20 ..
lrwxrwxrwx  1 1001 root   21 Oct 14 11:55 sites -> /bitnami/drupal/sites
lrwxrwxrwx  1 1001 root   22 Oct 14 11:55 themes -> /bitnami/drupal/themes
lrwxrwxrwx  1 1001 root   23 Oct 14 11:55 modules -> /bitnami/drupal/modules
lrwxrwxrwx  1 1001 root   24 Oct 14 11:55 profiles -> /bitnami/drupal/profiles
drwxrwxr-x  1 root root 4.0K Oct 14 11:55 .
:end:

** Persistence is in =/bitnami/drupal=

#+begin_src bash
df -hT /bitnami/drupal
Filesystem            Type  Size  Used Avail Use% Mounted on
/dev/mapper/data-root ext4  461G  377G   60G  87% /bitnami/drupa
#+end_src


** PROBLEM 1

*** Ends abruptly on second run
...
drupalday2024-drupal-1   | drupal 11:40:00.29 INFO  ==> Restoring persisted Drupal installation
drupalday2024-drupal-1   | drupal 11:40:00.32 INFO  ==> Trying to connect to the database server

*** Tracked down to =scripts/libdrupal.sh= line ~180

cat scripts/libdrupal.sh

This seems to work:

#+begin_src diff
 - db_port="$(drupal_database_conf_get 'port')"
 + db_port=3306
#+end_src

therefore the problem seems to be with drupal_database_conf_get on numeric values

scripts/libdrupal.sh:206:drupal_database_conf_get()

grep -E "^\s*'${key}' =>" "$DRUPAL_CONF_FILE" | grep -E -o "=> '.*'" | cut -f2 -d\'

*** FIX PR / PATCH
